{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Merge",
            "config": {
                "name": "merge_1",
                "mode": "sum",
                "mode_type": "raw",
                "concat_axis": -1,
                "dot_axes": -1,
                "output_shape": null,
                "output_shape_type": "raw",
                "output_mask": null,
                "output_mask_type": "raw",
                "arguments": {},
                "layers": [
                    {
                        "class_name": "Sequential",
                        "config": [
                            {
                                "class_name": "Embedding",
                                "config": {
                                    "name": "embedding_1",
                                    "trainable": true,
                                    "batch_input_shape": [
                                        null,
                                        48
                                    ],
                                    "dtype": "float32",
                                    "input_dim": 2214,
                                    "output_dim": 50,
                                    "embeddings_initializer": {
                                        "class_name": "RandomUniform",
                                        "config": {
                                            "minval": -0.05,
                                            "maxval": 0.05,
                                            "seed": null
                                        }
                                    },
                                    "embeddings_regularizer": null,
                                    "activity_regularizer": null,
                                    "embeddings_constraint": null,
                                    "mask_zero": false,
                                    "input_length": 48
                                }
                            },
                            {
                                "class_name": "Dropout",
                                "config": {
                                    "name": "dropout_1",
                                    "trainable": true,
                                    "rate": 0.3,
                                    "noise_shape": null,
                                    "seed": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "Sequential",
                        "config": [
                            {
                                "class_name": "Embedding",
                                "config": {
                                    "name": "embedding_2",
                                    "trainable": true,
                                    "batch_input_shape": [
                                        null,
                                        34
                                    ],
                                    "dtype": "float32",
                                    "input_dim": 2214,
                                    "output_dim": 50,
                                    "embeddings_initializer": {
                                        "class_name": "RandomUniform",
                                        "config": {
                                            "minval": -0.05,
                                            "maxval": 0.05,
                                            "seed": null
                                        }
                                    },
                                    "embeddings_regularizer": null,
                                    "activity_regularizer": null,
                                    "embeddings_constraint": null,
                                    "mask_zero": false,
                                    "input_length": 34
                                }
                            },
                            {
                                "class_name": "Dropout",
                                "config": {
                                    "name": "dropout_2",
                                    "trainable": true,
                                    "rate": 0.3,
                                    "noise_shape": null,
                                    "seed": null
                                }
                            },
                            {
                                "class_name": "LSTM",
                                "config": {
                                    "name": "lstm_1",
                                    "trainable": true,
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": false,
                                    "stateful": false,
                                    "unroll": false,
                                    "units": 50,
                                    "activation": "tanh",
                                    "recurrent_activation": "hard_sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "class_name": "VarianceScaling",
                                        "config": {
                                            "scale": 1.0,
                                            "mode": "fan_avg",
                                            "distribution": "uniform",
                                            "seed": null
                                        }
                                    },
                                    "recurrent_initializer": {
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "gain": 1.0,
                                            "seed": null
                                        }
                                    },
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {}
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "implementation": 1
                                }
                            },
                            {
                                "class_name": "RepeatVector",
                                "config": {
                                    "name": "repeat_vector_1",
                                    "trainable": true,
                                    "n": 48
                                }
                            }
                        ]
                    }
                ]
            }
        },
        {
            "class_name": "LSTM",
            "config": {
                "name": "lstm_2",
                "trainable": true,
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "units": 50,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 1
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_3",
                "trainable": true,
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "name": "dense_1",
                "trainable": true,
                "units": 4,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            }
        }
    ],
    "keras_version": "2.1.1",
    "backend": "tensorflow"
}